//6 Создайте число. Определите, является ли последняя цифра семеркой.
        
package HW2;

import java.util.Random;

/**
 * Created by Vitali_Bazhko on 4/13/2015.
 */
public class Exercise6 {
    public static void main(String[] args) {
    Random random = new Random();
        System.out.println(random);
    }
}
